Documents/бит_УстановкаСтавокПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаСтавокПоУслугам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СтавкиНаУслуги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмеетЛьготнуюСтавку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ТарифныеГруппыПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтавкиНаУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛьготнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативПотребленияПоКу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНормативнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_НормыНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НормыНаУслуги</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаОдного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаДвоих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопНормаНаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопНормаНаКаждого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДопНормуНаОдного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьДопНормуНаЛьготника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПотребленияПоКу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСемью6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативОДН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособРасчетаПоУслуге</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипыНачисленийПоЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыНачисленийПоЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Эксплуатационная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коммунальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_УстановкаСтавокПоУслугам/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.
Перем мДеревоМакетов;            // Хранит дерево макетов печатных форм.
Перем мПодменюПечати;            // Хранит элемент управления подменю печати.
Перем мПечатьПоУмолчанию;        // Хранит элемент управления кнопку печать по умолчанию.
Перем мСписокПоставщиков;        // Хранит Список поставщиков услуги.
Перем мСписокРежимовПотребления; // Хранит список режимов потребления.
Перем мСписокСпособовРасчета;    // Хранит список способов расчета.
Перем мСтарыйСпособРасчета;      // Хранит предыдущее значение способа расчета.
Перем мСтарыйРежим;              // Хранит предыдущее значение режима потребления.
Перем мСтарыйПоставщик;          // Хранит предыдущее значение поставщика.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"     , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("УслугаПустаяСсылка"       , Справочники.бит_УслугиЖКХ.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ЗданиеПустаяСсылка"       , Справочники.бит_СписокЗданий.ПустаяСсылка());
	КэшированныеЗначения.Вставить("мСтарыйПоставщик"         , Неопределено);
	КэшированныеЗначения.Вставить("мСписокПоставщиков"       , Новый СписокЗначений );
	КэшированныеЗначения.Вставить("мСтарыйРежим"             , Неопределено);
	КэшированныеЗначения.Вставить("мСписокРежимовПотребления", Новый СписокЗначений );
	КэшированныеЗначения.Вставить("мСписокНормативов"        , Неопределено);
	КэшированныеЗначения.Вставить("мСписокСпособовРасчета"   , Новый СписокЗначений );
	КэшированныеЗначения.Вставить("мСтарыйСпособРасчета"     , Неопределено);
	
КонецПроцедуры

&НаСервере
// Процедура содержит список нормативов из регистра по текущей услуге на текущую дату.
//
Процедура СписокНормативов()	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НормыНаУслугиСрезПоследних.Услуга КАК Услуга,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге КАК СпособРасчетаПоУслуге,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу,
	|	бит_НормыНаУслугиСрезПоследних.НаОдного,
	|	бит_НормыНаУслугиСрезПоследних.НаДвоих,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью4,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью5,
	|	бит_НормыНаУслугиСрезПоследних.НаСемью6
	|ИЗ
	|	РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Момент, Услуга = &Услуга) КАК бит_НормыНаУслугиСрезПоследних
	|ГДЕ
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления <> ЗНАЧЕНИЕ(Справочник.бит_РежимыПотребленияУслуг.Нет)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	СпособРасчетаПоУслуге,
	|	РежимПотребления,
	|	СтатусКвартиры,
	|	ТипКвартиры";
	
	Запрос.УстановитьПараметр("Момент", Объект.Дата);
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	
	АдресСписокНормативовВХранилище = ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить(), УникальныйИдентификатор);
	
	СписокНормативовИзХранилища  = ПолучитьИзВременногоХранилища(АдресСписокНормативовВХранилище);
	
КонецПроцедуры

// Процедура отбирает из таблицы с нормативами.
// Ту строку, которая Соответствует критериям отбора.
//
&НаКлиенте
Процедура НормативТекущейСтроки()
	
	ТекСтрока = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.РежимПотребления) И ЗначениеЗаполнено(ТекСтрока.СпособРасчета)
		И ЗначениеЗаполнено(ТекСтрока.СтатусКвартиры) И ЗначениеЗаполнено(ТекСтрока.ТипКвартиры)
		Тогда
		
		Если НормативТекущейСтрокиНаСервере() Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("РежимПотребления",ТекСтрока.РежимПотребления);
			Отбор.Вставить("СпособРасчетаПоУслуге",ТекСтрока.СпособРасчета);
			Отбор.Вставить("СтатусКвартиры",ТекСтрока.СтатусКвартиры);
			Отбор.Вставить("ТипКвартиры",ТекСтрока.ТипКвартиры);
			
			НормативПотребленияПоКу = НайтиСтрокиНаСервере(Отбор);
			
			Если НормативПотребленияПоКу > 0 Тогда
				ТекСтрока.НормативПотребленияПоКу = НормативПотребленияПоКу;
			Иначе
				ТекСтрока.НормативПотребленияПоКу = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НормативТекущейСтрокиНаСервере();
	
	СписокНормативовИзХранилища  = ПолучитьИзВременногоХранилища(АдресСписокНормативовВХранилище);
	
	Если  СписокНормативовИзХранилища.Количество() <> 0 Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиСтрокиНаСервере(Отбор);
	
	СписокНормативовИзХранилища  = ПолучитьИзВременногоХранилища(АдресСписокНормативовВХранилище);
	
	Строки = СписокНормативовИзХранилища.НайтиСтроки(Отбор);
	
	Если Строки.Количество() > 0 Тогда
		НайденныйНорматив = Строки[0];
		НормативПотребленияПоКу = НайденныйНорматив.НормативПотребленияПоКу;
	Иначе
		НормативПотребленияПоКу = 0;
	КонецЕсли;
	
	Возврат НормативПотребленияПоКу;
	
КонецФункции

// Процедура осуществляет управление видимостью/доступностью реквизитов формы.
//
&НаСервере
Процедура УстановитьВидимость()
	
	ВидимостьКолонки = (Объект.Услуга.ТипыНачислений = Перечисления.бит_ТипыНачисленийПоЖКХ.Коммунальная);
	
	Элементы.СтавкиНаУслугиТариф.Видимость                   = ВидимостьКолонки;  
	Элементы.СтавкиНаУслугиНормативПотребленияПоКу.Видимость = ВидимостьКолонки;
	
	ВидимостьКолонкиЛьготнаяСтавка					= Объект.ИмеетЛьготнуюСтавку;
	Элементы.СтавкиНаУслугиЛьготнаяСтавка.Видимость	= ВидимостьКолонкиЛьготнаяСтавка;
	
КонецПроцедуры //УстановитьВидимость()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мСписокПоставщиков        = Новый СписокЗначений;
	мСписокСпособовРасчета    = Новый СписокЗначений;
	мСписокРежимовПотребления = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Объект.Услуга) Тогда
		
		ТаблицаПоставщиков = Объект.Услуга.Поставщики;
		
		Индекс = -1;
		Для каждого строка из ТаблицаПоставщиков Цикл
			Индекс = Индекс + 1;
			
			мСписокПоставщиков.Вставить(Индекс,строка.Поставщик);	
			
		КонецЦикла;	
		
		ТаблицаРежимыПотребленияУслуг = Объект.Услуга.РежимыПотребленияУслуг;
		
		Индекс = -1;
		Для каждого строка из ТаблицаРежимыПотребленияУслуг Цикл
			Индекс = Индекс + 1;
			
			мСписокПоставщиков.Вставить(Индекс,строка.РежимПотребленияУслуг);	
			
		КонецЦикла;	
		
		ТаблицаСпособыРасчета = Объект.Услуга.СпособыРасчета;
		
		Индекс = -1;
		Для каждого строка из ТаблицаСпособыРасчета Цикл
			Индекс = Индекс + 1;
			
			мСписокПоставщиков.Вставить(Индекс,строка.СпособРасчета);	
			
		КонецЦикла;	
		
	КонецЕсли; 
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаУслугиЖКХ") Тогда
		
		Объект.Услуга = Параметры.ЗаполнитьИзСправочникаУслугиЖКХ.УслугаВладелец;
		
		Элементы.Услуга.ТолькоПросмотр = Истина;	
		
	КонецЕсли; 
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_УстановкаСтавокПоУслугам"));
	
	// Вызов механизма разделения прав доступа.
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ, СтандартнаяОбработка, ДокументОбъект, ЭтаФорма);	
	
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	Элементы.Файлы.Доступность = РольДоступна("ПолныеПрава");
	
	// Установить видимость реквизитов и заголовков колонок.	
	УстановитьВидимость();            
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Организация, Услуга, Поставщик");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(Объект, ЭтаФорма,СтруктураРеквизитов);
	
	// Установить доступность формы с учетом даты запрета редактирования.
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	СписокНормативов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	СтруктураЗаголовка = Новый Структура;
	
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма, СтруктураЗаголовка);	
	
	// Установить видимость реквизитов и заголовков колонок.	
	УстановитьВидимость();
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Организация, Услуга, Поставщик");
	
	АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов);
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
	СписокНормативов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма,СтруктураЗаголовка);	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСтавкиНаУслуги

// Процедура - обработчик события "ПриИзменении" поля ввода ПлановаяСтавка.
// В строке табличной части "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиПлановаяСтавкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	ТекущаяСтрока.ОсновнаяСтавка = ТекущаяСтрока.ПлановаяСтавка;
	
	ТекущаяСтрока.СверхНормативнаяСтавка = ТекущаяСтрока.ПлановаяСтавка;
	
КонецПроцедуры

//  Процедура - обработчик события "НачалоВыбора" поля ввода "Поставщик" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мСписокПоставщиков = ВыборПоставщикаНаСервере(Объект.Ссылка);
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйПоставщик = ТекущаяСтрока.Поставщик;
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая",,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = мСписокПоставщиков;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ТекущаяСтрока.Поставщик;
	
	ФормаВыбора.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
КонецПроцедуры

//  Процедура - обработчик события "НачалоВыбора" поля ввода "СпособРасчета" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиСпособРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	мСписокСпособовРасчета = ВыборСпособовРасчетаНаСервере(Объект.Ссылка);
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйРежим = ТекущаяСтрока.РежимПотребления;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаполнитьИзДокументаУстановкаСтавокПоУслугам",);
	ФормаВыбора = ОткрытьФорму("Перечисление.бит_СпособыРасчетаПоУслугам.Форма.ФормаВыбораУправляемая",ПараметрыФормы,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = мСписокСпособовРасчета;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

//  Процедура - обработчик события "НачалоВыбора" поля ввода "РежимПотребления" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиРежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мСписокРежимовПотребления = ВыборРежимовПотребленияНаСервере(Объект.Ссылка);
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйРежим = ТекущаяСтрока.РежимПотребления;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаполнитьИзДокументаУстановкаСтавокПоУслугам",);
	ФормаВыбора = ОткрытьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая",ПараметрыФормы,Элемент);
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = мКэшЗначений.мСписокРежимовПотребления;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = ТекущаяСтрока.Поставщик;
	
	ФормаВыбора.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "Поставщик" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиПоставщикПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	Если мКэшЗначений.мСписокПоставщиков.НайтиПоЗначению(ТекущиеДанные.Поставщик) = Неопределено И мКэшЗначений.мСписокПоставщиков.Количество() > 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ТекущиеДанные.Поставщик + " не является поставщиком услуги: " + Объект.Услуга + ".");
		
		ТекущиеДанные.Поставщик = мКэшЗначений.мСтарыйПоставщик;
		
	КонецЕсли;
	
КонецПроцедуры

//  Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "Поставщик" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиПоставщикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйПоставщик = ТекущиеДанные.Поставщик;
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "РежимПотребления" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиРежимПотребленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	Если мКэшЗначений.мСписокРежимовПотребления.НайтиПоЗначению(ТекущиеДанные.РежимПотребления) = Неопределено И мКэшЗначений.мСписокРежимовПотребления.Количество() > 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ТекущиеДанные.РежимПотребления + " не является режимом потребления услуги: " + Объект.Услуга + ".");
		
		ТекущиеДанные.РежимПотребления = мКэшЗначений.мСтарыйРежим;
		
	КонецЕсли;
	
	НормативТекущейСтроки();
	
КонецПроцедуры

//  Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "РежимПотребления" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиРежимПотребленияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйРежим = ТекущиеДанные.РежимПотребления;
	
КонецПроцедуры

//  Процедура - обработчик события "ПриИзменении" поля ввода "СпособРасчета" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиСпособРасчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	Если мКэшЗначений.мСписокСпособовРасчета.НайтиПоЗначению(ТекущиеДанные.СпособРасчета) = Неопределено И мКэшЗначений.мСписокСпособовРасчета.Количество() > 0 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ТекущиеДанные.СпособРасчета + " не является режимом потребления услуги: " + Объект.Услуга + ".");
		
		ТекущиеДанные.СпособРасчета = мКэшЗначений.мСтарыйСпособРасчета;
		
	КонецЕсли;
	
	НормативТекущейСтроки();
	
	
КонецПроцедуры

//  Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода "СпособРасчета" табличного поля "СтавкиНаУслуги".
//
&НаКлиенте
Процедура СтавкиНаУслугиСпособРасчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СтавкиНаУслуги.ТекущиеДанные;
	
	мКэшЗначений.мСтарыйСпособРасчета = ТекущиеДанные.СпособРасчета;
	
КонецПроцедуры

// Процедура - Изменяет норматив текущей строки. 
//
&НаКлиенте
Процедура СтавкиНаУслугиСтатусКвартирыПриИзменении(Элемент)
	
	НормативТекущейСтроки();
	
КонецПроцедуры

// Процедура - Изменяет норматив текущей строки. 
//
&НаКлиенте
Процедура СтавкиНаУслугиТипКвартирыПриИзменении(Элемент)
	
	НормативТекущейСтроки();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

// Процедура - обработчик события "Нажатие" кнопки "Файлы" коммандной панели "ДействияФормы". 
//
&НаКлиенте
Процедура Файлы(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ФайлыЗавершение", ЭтотОбъект), "Сначала запишите документ.");
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.бит_рз_ХранилищеДополнительнойИнформации.Форма.ФормаСпискаУправляемая", Новый Структура("ЗаполнитьИзДокументаУстановкаСтавокПоУслугам", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

// Процедура - Расчитывает  ставки текущей строки. 
//
&НаКлиенте
Процедура РасчитатьСтавки(Команда)
	
	Для каждого Строка Из Объект.СтавкиНаУслуги Цикл
		
		Ставка = Строка.Тариф * Строка.НормативПотребленияПоКу;
		
		Строка.ПлановаяСтавка         = Ставка;
		Строка.ОсновнаяСтавка         = Ставка;
		Строка.СверхНормативнаяСтавка = Ставка;
		
	КонецЦикла;  
	
КонецПроцедуры

// Процедура - Заполняет нормативы из норм услуги текущей строки. 
//
&НаКлиенте
Процедура ЗаполнитьНормативы(Команда)
	
	ЗаполнитьНормативыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	ЗаполнитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьТарифНорматив(Команда)
	
	Элементы.СтавкиНаУслугиТариф.Видимость                       = Истина;  
	Элементы.СтавкиНаУслугиНормативПотребленияПоКу.Видимость     = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура - Заполняет список нормативов кэша значений. 
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СписокНормативов();
	
КонецПроцедуры

&НаСервере
Функция ВыборПоставщикаНаСервере(СсылкаНаУслугу)
	
	Поставщики  = Объект.Услуга.Поставщики;
	
	мСписокПоставщиков = Новый СписокЗначений;
	
	мСписокПоставщиков.Очистить();
	
	Для Каждого ТекСтрока Из Поставщики Цикл
		
		мСписокПоставщиков.Добавить(ТекСтрока.Поставщик);
		
	КонецЦикла;
	
	мКэшЗначений.мСписокПоставщиков = мСписокПоставщиков;
	
	Возврат мСписокПоставщиков;
	
КонецФункции

&НаСервере
Функция ВыборРежимовПотребленияНаСервере(СсылкаНаУслугу)
	
	РежимыПотребления  = Объект.Услуга.РежимыПотребленияУслуг;
	
	мКэшЗначений.мСписокРежимовПотребления.Очистить();
	
	Для Каждого ТекСтрока Из РежимыПотребления Цикл
		
		мКэшЗначений.мСписокРежимовПотребления.Добавить(ТекСтрока.РежимПотребленияУслуг);
		
	КонецЦикла;
	
	мСписокРежимовПотребления = мКэшЗначений.мСписокРежимовПотребления;
	
	Возврат мСписокРежимовПотребления;
	
КонецФункции

&НаСервере
Функция ВыборСпособовРасчетаНаСервере(СсылкаНаУслугу)
	
	СпособыРасчета  = Объект.Услуга.СпособыРасчета;
	
	мКэшЗначений.мСписокСпособовРасчета.Очистить();
	
	Для Каждого ТекСтрока Из СпособыРасчета Цикл
		
		мКэшЗначений.мСписокСпособовРасчета.Добавить(ТекСтрока.СпособРасчета);
		
	КонецЦикла;
	
	мСписокСпособовРасчета = мКэшЗначений.мСписокСпособовРасчета;
	
	Возврат мСписокСпособовРасчета;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНормативыНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХПоставщики.Поставщик,
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге КАК СпособРасчета,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу
	|ИЗ
	|	Справочник.бит_УслугиЖКХ.Поставщики КАК бит_УслугиЖКХПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, Услуга = &Услуга) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО бит_УслугиЖКХПоставщики.Ссылка = бит_НормыНаУслугиСрезПоследних.Услуга
	|ГДЕ
	|	бит_УслугиЖКХПоставщики.Ссылка = &Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпособРасчета,
	|	РежимПотребления,
	|	СтатусКвартиры,
	|	ТипКвартиры";
	Запрос.УстановитьПараметр("Дата"     , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Услуга"   , Объект.Услуга);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Поставщик"       , Выборка.Поставщик);
		Отбор.Вставить("СпособРасчета"   , Выборка.СпособРасчета);
		Отбор.Вставить("РежимПотребления", Выборка.РежимПотребления);
		Отбор.Вставить("ТипКвартиры"     , Выборка.ТипКвартиры);
		Отбор.Вставить("СтатусКвартиры"  , Выборка.СтатусКвартиры);
		
		СтрокиПоиска = Объект.СтавкиНаУслуги.НайтиСтроки(Отбор);
		
		Для каждого Строка Из СтрокиПоиска Цикл
			
			Строка.НормативПотребленияПоКу = Выборка.НормативПотребленияПоКу;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УслугиЖКХПоставщики.Поставщик,
	|	бит_НормыНаУслугиСрезПоследних.Услуга,
	|	бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге КАК СпособРасчета,
	|	бит_НормыНаУслугиСрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_НормыНаУслугиСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_НормыНаУслугиСрезПоследних.НормативПотребленияПоКу
	|ИЗ
	|	Справочник.бит_УслугиЖКХ.Поставщики КАК бит_УслугиЖКХПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(&Дата, Услуга = &Услуга) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО бит_УслугиЖКХПоставщики.Ссылка = бит_НормыНаУслугиСрезПоследних.Услуга
	|ГДЕ
	|	бит_УслугиЖКХПоставщики.Ссылка = &Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпособРасчета,
	|	РежимПотребления,
	|	СтатусКвартиры,
	|	ТипКвартиры";
	Запрос.УстановитьПараметр("Дата"     , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Услуга"   , Объект.Услуга);
	
	Результат = Запрос.Выполнить();
	
	Если Объект.СтавкиНаУслуги.Количество() > 0 Тогда
		
	КонецЕсли;
	
	Объект.СтавкиНаУслуги.Очистить();
	Объект.СтавкиНаУслуги.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(ДокументОбъект, ЭтаФорма, СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ИмеетЛьготнуюСтавкуПриИзменении(Элемент)
	
	УстановитьВидимость();
	Для каждого Строка Из Объект.СтавкиНаУслуги Цикл
		Строка.ЛьготнаяСтавка = 0;
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти
